<a href="https://colab.research.google.com/github/eswarpoluri/ML-DL-Practice-Assignments/blob/master/ML/Pandas/4.%20Joining%20%26%20Merging/Pandas_Joining_%26_merging_DF_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

Q1. Write a Pandas program to join the two given dataframes "student_data1", "student_data2" along rows and assign all data.

Output:

      student_id	   name           	marks
    0	S1	        Danniella Fenton	200
    1	S2	        Ryder Storey    	210
    2	S3	        Bryce Jensen    	190
    3	S4	        Ed Bernal	        222
    4	S5	        Kwame Morin	      199
    0	S4	        Scarlette Fisher	201
    1	S5	        Carla Williamson	200
    2	S6	        Dante Morse	      198
    3	S7	        Kaiser William	  219
    4	S8	        Madeeha Preston	  201

In [ ]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [ ]:
student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Q2. Write a Pandas program to join the two above dataframes along columns and assign all data.

Q3. Write a Pandas program to append a row "s6" to an existing DataFrame "student_data1" and display the combined data.

s6 = ['S6', 'Scarlette Fisher', 205]

In [ ]:
s6 = ['S6', 'Scarlette Fisher', 205]
s6_s = pd.Series(['S6', 'Scarlette Fisher', 205], index=['student_id', 'name', 'marks'])

Q4. Write a Pandas program to append a list of dictioneries "dicts" to a existing DataFrame "student_data1" and display the combined data.

In [ ]:
dicts = [{'student_id': 'S6', 'name': 'Scarlette Fisher', 'marks': 203},
         {'student_id': 'S7', 'name': 'Bryce Jensen', 'marks': 207}]

Q5. Write a Pandas program to 

  a. join the two given dataframes "student_data1" & "student_data2" along rows and

  b. merge with another dataframe "exam_data" to fetch exam id's for all student's.

In [ ]:
exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})
exam_data

   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

Q6. Write a Pandas program to join the two dataframes "student_data1", "student_data2" and get information of repeated student_id's only.

Q7. Write a Pandas program to join the two dataframes "student_data1", "student_data2" side by side, keep all records of both DF's and allign matching records of both DF's in same row.

Q8. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [ ]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']})
data1

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

In [ ]:
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
data2

  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

Q9. Write a Pandas program to join two dataframes using keys from right dataframe only.

Q10. Write a Pandas program to merge two given datasets using multiple join keys.

Q11. Write a Pandas program to create a combination from two dataframes where a column id combination appears more than once in both dataframes.

Q12. Write a Pandas program to merge two given dataframes with different columns.

Q13. Write a Pandas program to 

  a. create a new DataFrame based on existing series "s1","s2","s3" as columns and 

  b. override the existing columns names with 'column1', 'column2', 'column3'.

In [ ]:
s1 = pd.Series([0, 1, 2, 3], name='col1')
s2 = pd.Series([0, 1, 2, 3])
s3 = pd.Series([0, 1, 4, 5], name='col3')

Q14. Write a Pandas program to combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [ ]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
data1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
data2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

Q.15 Write a Pandas program to Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame.

In [ ]:
df1 = pd.DataFrame({'A': [None, 0, None], 'B': [3, 4, 5]})
df2 = pd.DataFrame({'A': [1, 1, 3], 'B': [3, None, 3]})
df1

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

In [ ]:
df2

   A    B
0  1  3.0
1  1  NaN
2  3  3.0